In [1]:
import os
import numpy as np
import pandas as pd

In [2]:
os.chdir("D:\\Workspace\\Teaching\\2017 - Data Science\\Course\\data")

# Data Structures - Series

In [3]:
pd.Series?

In [4]:
s1 = pd.Series([7, 'Heisenberg', 3.14, -1789710578, 'Happy Eating!'])   # By default, each item will receive an index label from 0 to N-1

In [5]:
s1

0                7
1       Heisenberg
2             3.14
3      -1789710578
4    Happy Eating!
dtype: object

In [6]:
s1.shape

(5,)

In [7]:
s1[1]

'Heisenberg'

In [8]:
s1.ix[1]  # select rows based on the index using the ix method

'Heisenberg'

In [9]:
s1.iloc[1] # selection by position

'Heisenberg'

In [10]:
s1[1:3]

1    Heisenberg
2          3.14
dtype: object

In [11]:
s1.ix[1:3]

1     Heisenberg
2           3.14
3    -1789710578
dtype: object

In [12]:
s1.iloc[1:3]

1    Heisenberg
2          3.14
dtype: object

In [13]:
s2 = pd.Series([7, 'Heisenberg', 3.14, -1789710578, 'Happy Eating!'], index=['A', 'Z', 'C', 'Y', 'E'])   # We can specify an index to use when creating the Series

In [14]:
s2

A                7
Z       Heisenberg
C             3.14
Y      -1789710578
E    Happy Eating!
dtype: object

In [15]:
s2[2], s2['C'], s2.loc['C'] #  .loc - label-location based indexer

(3.14, 3.14, 3.14)

In [16]:
s2[['C', 'E']]

C             3.14
E    Happy Eating!
dtype: object

In [17]:
s2.loc[['C', 'E']]

C             3.14
E    Happy Eating!
dtype: object

### Dictionary as a constructor

In [18]:
d = {'Chicago': 1000, 'New York': 1300, 'Portland': 900, 'San Francisco': 1100, 'Austin': 450, 'Boston': None}
cities = pd.Series(d)    # Series constructor can convert a dictionary using the keys of the dictionary as its index

In [19]:
cities

Austin            450.0
Boston              NaN
Chicago          1000.0
New York         1300.0
Portland          900.0
San Francisco    1100.0
dtype: float64

In [20]:
cities_selected = cities[['Chicago', 'Portland', 'San Francisco']]
cities_selected

Chicago          1000.0
Portland          900.0
San Francisco    1100.0
dtype: float64

In [21]:
cities_less_1000 = cities[cities < 1000]
cities_less_1000

Austin      450.0
Portland    900.0
dtype: float64

In [22]:
cities['Chicago'] = 1400    # changing value based on the index
print('New value for Chicago:', cities['Chicago'])

New value for Chicago: 1400.0

In [23]:
'Seattle' in cities, 'San Francisco' in cities # Boolean expressions

(False, True)

In [24]:
cities / 3  # Mathematical operations

Austin           150.000000
Boston                  NaN
Chicago          466.666667
New York         433.333333
Portland         300.000000
San Francisco    366.666667
dtype: float64

In [25]:
np.square(cities)

Austin            202500.0
Boston                 NaN
Chicago          1960000.0
New York         1690000.0
Portland          810000.0
San Francisco    1210000.0
dtype: float64

In [26]:
cities.isnull()  # NULL checking

Austin           False
Boston            True
Chicago          False
New York         False
Portland         False
San Francisco    False
dtype: bool

In [27]:
d1 = {'Ohio': 35000, 'Texas': 71000, 'Oregon': 16000, 'Utah': 5000}
cities1 = pd.Series(d1)
d2 = {'California': 40000, 'Texas': 15000, 'Oregon': 16500, 'Iowa': 10000}
cities2 = pd.Series(d2)
cities1 + cities2 # automatically aligns differently indexed data in arithmetic operations

California        NaN
Iowa              NaN
Ohio              NaN
Oregon        32500.0
Texas         86000.0
Utah              NaN
dtype: float64

# Data Structures - DataFrame

In [28]:
pd.DataFrame?

In [29]:
# Create an example dataframe about a fictional army
raw_data = {'regiment': ['Nighthawks', 'Nighthawks', 'Nighthawks', 'Nighthawks', 'Dragoons', 'Dragoons', 'Dragoons', 'Dragoons', 'Scouts', 'Scouts', 'Scouts', 'Scouts'],
            'company': ['1st', '1st', '2nd', '2nd', '1st', '1st', '2nd', '2nd','1st', '1st', '2nd', '2nd'],
            'deaths': [523, 52, 25, 616, 43, 234, 523, 62, 62, 73, 37, 35],
            'battles': [5, 42, 2, 2, 4, 7, 8, 3, 4, 7, 8, 9],
            'size': [1045, 957, 1099, 1400, 1592, 1006, 987, 849, 973, 1005, 1099, 1523],
            'veterans': [1, 5, 62, 26, 73, 37, 949, 48, 48, 435, 63, 345],
            'readiness': [1, 2, 3, 3, 2, 1, 2, 3, 2, 1, 2, 3],
            'armored': [1, 0, 1, 1, 0, 1, 0, 1, 0, 0, 1, 1],
            'deserters': [4, 24, 31, 2, 3, 4, 24, 31, 2, 3, 2, 3],
            'origin': ['Arizona', 'California', 'Texas', 'Florida', 'Maine', 'Iowa', 'Alaska', 'Washington', 'Oregon', 'Wyoming', 'Louisana', 'Georgia']}

df = pd.DataFrame(raw_data, columns = ['regiment', 'company', 'deaths', 'battles', 'size', 'veterans', 'readiness', 'armored', 'deserters', 'origin'])

df.head()

,regiment,company,deaths,battles,size,veterans,readiness,armored,deserters,origin
0,Nighthawks,1st,523,5,1045,1,1,1,4,Arizona
1,Nighthawks,1st,52,42,957,5,2,0,24,California
2,Nighthawks,2nd,25,2,1099,62,3,1,31,Texas
3,Nighthawks,2nd,616,2,1400,26,3,1,2,Florida
4,Dragoons,1st,43,4,1592,73,2,0,3,Maine

In [30]:
df.dtypes

regiment     object
company      object
deaths        int64
battles       int64
size          int64
veterans      int64
readiness     int64
armored       int64
deserters     int64
origin       object
dtype: object

In [31]:
df = df.set_index('origin')
df.head()

,regiment,company,deaths,battles,size,veterans,readiness,armored,deserters
origin,,,,,,,,,
Arizona,Nighthawks,1st,523,5,1045,1,1,1,4
California,Nighthawks,1st,52,42,957,5,2,0,24
Texas,Nighthawks,2nd,25,2,1099,62,3,1,31
Florida,Nighthawks,2nd,616,2,1400,26,3,1,2
Maine,Dragoons,1st,43,4,1592,73,2,0,3

In [32]:
df['size'] # Select a column

origin
Arizona       1045
California     957
Texas         1099
Florida       1400
Maine         1592
Iowa          1006
Alaska         987
Washington     849
Oregon         973
Wyoming       1005
Louisana      1099
Georgia       1523
Name: size, dtype: int64

In [33]:
df[['size', 'veterans']] # Select multiple columns

            size  veterans
origin
Arizona     1045         1
California   957         5
Texas       1099        62
Florida     1400        26
Maine       1592        73
Iowa        1006        37
Alaska       987       949
Washington   849        48
Oregon       973        48
Wyoming     1005       435
Louisana    1099        63
Georgia     1523       345

In [34]:
df.loc[:'Arizona'] # Select all rows by index label

,regiment,company,deaths,battles,size,veterans,readiness,armored,deserters
origin,,,,,,,,,
Arizona,Nighthawks,1st,523,5,1045,1,1,1,4

In [35]:
df.iloc[:2] # Select every row up to defined index of row

,regiment,company,deaths,battles,size,veterans,readiness,armored,deserters
origin,,,,,,,,,
Arizona,Nighthawks,1st,523,5,1045,1,1,1,4
California,Nighthawks,1st,52,42,957,5,2,0,24

In [36]:
df.iloc[2:] # Select every row after the defined index of row

,regiment,company,deaths,battles,size,veterans,readiness,armored,deserters
origin,,,,,,,,,
Texas,Nighthawks,2nd,25,2,1099,62,3,1,31
Florida,Nighthawks,2nd,616,2,1400,26,3,1,2
Maine,Dragoons,1st,43,4,1592,73,2,0,3
Iowa,Dragoons,1st,234,7,1006,37,1,1,4
Alaska,Dragoons,2nd,523,8,987,949,2,0,24
Washington,Dragoons,2nd,62,3,849,48,3,1,31
Oregon,Scouts,1st,62,4,973,48,2,0,2
Wyoming,Scouts,1st,73,7,1005,435,1,0,3
Louisana,Scouts,2nd,37,8,1099,63,2,1,2
Georgia,Scouts,2nd,35,9,1523,345,3,1,3

In [37]:
df.iloc[1:2]

,regiment,company,deaths,battles,size,veterans,readiness,armored,deserters
origin,,,,,,,,,
California,Nighthawks,1st,52,42,957,5,2,0,24

In [38]:
df.iloc[:,:2] # Select the first 2 columns

              regiment company
origin
Arizona     Nighthawks     1st
California  Nighthawks     1st
Texas       Nighthawks     2nd
Florida     Nighthawks     2nd
Maine         Dragoons     1st
Iowa          Dragoons     1st
Alaska        Dragoons     2nd
Washington    Dragoons     2nd
Oregon          Scouts     1st
Wyoming         Scouts     1st
Louisana        Scouts     2nd
Georgia         Scouts     2nd

In [39]:
df.ix[['Arizona', 'Texas']]   # .ix is the combination of both .loc and .iloc. Integers are first considered labels, but if not found, falls back on positional indexing

,regiment,company,deaths,battles,size,veterans,readiness,armored,deserters
origin,,,,,,,,,
Arizona,Nighthawks,1st,523,5,1045,1,1,1,4
Texas,Nighthawks,2nd,25,2,1099,62,3,1,31

In [40]:
df.ix['Arizona', 'deaths']  # Select the third cell in the row named Arizona

523

In [41]:
df.ix['Arizona', 2] # Select the third cell in the row named Arizona

523

In [42]:
df.ix[2, 'deaths'] # Select the third cell down in the column named deaths

25

### Read/write csv file

In [43]:
data_from_csv = pd.read_csv('mariano-rivera.csv')
data_from_csv.head()

,Year,Age,Tm,Lg,W,L,W-L%,ERA,G,GS,...,WP,BF,ERA+,WHIP,H/9,HR/9,BB/9,SO/9,SO/BB,Awards
0,1995,25,NYY,AL,5,3,0.625,5.51,19,10,...,0,301,84,1.507,9.5,1.5,4.0,6.9,1.70,NaN
1,1996,26,NYY,AL,8,3,0.727,2.09,61,0,...,1,425,240,0.994,6.1,0.1,2.8,10.9,3.82,CYA-3MVP-12
2,1997,27,NYY,AL,6,4,0.600,1.88,66,0,...,2,301,239,1.186,8.2,0.6,2.5,8.5,3.40,ASMVP-25
3,1998,28,NYY,AL,3,0,1.000,1.91,54,0,...,0,246,233,1.060,7.0,0.4,2.5,5.3,2.12,NaN
4,1999,29,NYY,AL,4,3,0.571,1.83,66,0,...,2,268,257,0.884,5.6,0.3,2.3,6.8,2.89,ASCYA-3MVP-14

In [44]:
data_from_csv.dtypes

Year        int64
Age         int64
Tm         object
Lg         object
W           int64
L           int64
W-L%      float64
ERA       float64
G           int64
GS          int64
GF          int64
CG          int64
SHO         int64
SV          int64
IP        float64
H           int64
R           int64
ER          int64
HR          int64
BB          int64
IBB         int64
SO          int64
HBP         int64
BK          int64
WP          int64
BF          int64
ERA+        int64
WHIP      float64
H/9       float64
HR/9      float64
BB/9      float64
SO/9      float64
SO/BB     float64
Awards     object
dtype: object

In [45]:
cities.to_csv('cities.csv') # Writing data to csv file, check data folder for file cities.csv

# Read/Write to Excel

In [46]:
data = {'year': [2010, 2011, 2012, 2011, 2012, 2010, 2011, 2012],
        'team': ['Bears', 'Bears', 'Bears', 'Packers', 'Packers', 'Lions', 'Lions', 'Lions'],
        'wins': [11, 8, 10, 15, 11, 6, 10, 4],
        'losses': [5, 8, 6, 1, 5, 10, 6, 12]}

In [47]:
football = pd.DataFrame(data, columns=['year', 'team', 'wins', 'losses'])   # columns parameter tells the constructor how to order columns

In [48]:
football

   year     team  wins  losses
0  2010    Bears    11       5
1  2011    Bears     8       8
2  2012    Bears    10       6
3  2011  Packers    15       1
4  2012  Packers    11       5
5  2010    Lions     6      10
6  2011    Lions    10       6
7  2012    Lions     4      12

In [49]:
football.to_excel('football.xlsx', index=False)

In [50]:
del football

In [51]:
football = pd.read_excel('football.xlsx', 'Sheet1')

In [52]:
football

   year     team  wins  losses
0  2010    Bears    11       5
1  2011    Bears     8       8
2  2012    Bears    10       6
3  2011  Packers    15       1
4  2012  Packers    11       5
5  2010    Lions     6      10
6  2011    Lions    10       6
7  2012    Lions     4      12

In [53]:
football.shape

(8, 4)

## Removing missing values

In [54]:
s = pd.Series(['aardvark', 'artichoke', np.nan, 'avocado'])

In [55]:
s

0     aardvark
1    artichoke
2          NaN
3      avocado
dtype: object

In [56]:
s.isnull()

0    False
1    False
2     True
3    False
dtype: bool

In [57]:
s.dropna()

0     aardvark
1    artichoke
3      avocado
dtype: object

In [58]:
df = pd.DataFrame([[1., 6.5, 3.], [1., None, None],[None, None, None], [None, 6.5, 3.]])

In [59]:
df

     0    1    2
0  1.0  6.5  3.0
1  1.0  NaN  NaN
2  NaN  NaN  NaN
3  NaN  6.5  3.0

In [60]:
df1 = df.dropna()  # dropna() by default drops any row containing a missing value
df1

     0    1    2
0  1.0  6.5  3.0

In [61]:
df1.shape

(1, 3)

In [62]:
df2 = df.dropna(how='all')   # how='all' will only drop rows that are all None
df2

     0    1    2
0  1.0  6.5  3.0
1  1.0  NaN  NaN
3  NaN  6.5  3.0

In [63]:
df = pd.DataFrame(np.random.randn(7, 3))
df.ix[:4, 1] = np.nan; df.ix[:2, 2] = np.nan
df

          0         1         2
0 -1.412371       NaN       NaN
1  0.025769       NaN       NaN
2  0.879552       NaN       NaN
3  0.201349       NaN  0.960288
4 -1.088520       NaN -0.635603
5  0.008473  0.285971  0.717458
6  0.436859  2.002107  0.432965

In [64]:
df.dropna(thresh=2)

          0         1         2
3  0.201349       NaN  0.960288
4 -1.088520       NaN -0.635603
5  0.008473  0.285971  0.717458
6  0.436859  2.002107  0.432965

## Filling missing values

In [65]:
df

          0         1         2
0 -1.412371       NaN       NaN
1  0.025769       NaN       NaN
2  0.879552       NaN       NaN
3  0.201349       NaN  0.960288
4 -1.088520       NaN -0.635603
5  0.008473  0.285971  0.717458
6  0.436859  2.002107  0.432965

In [66]:
df.fillna(0) #  Replasing missing values with constant value

          0         1         2
0 -1.412371  0.000000  0.000000
1  0.025769  0.000000  0.000000
2  0.879552  0.000000  0.000000
3  0.201349  0.000000  0.960288
4 -1.088520  0.000000 -0.635603
5  0.008473  0.285971  0.717458
6  0.436859  2.002107  0.432965

In [67]:
df.fillna({1: 0.5, 2: -1})

          0         1         2
0 -1.412371  0.500000 -1.000000
1  0.025769  0.500000 -1.000000
2  0.879552  0.500000 -1.000000
3  0.201349  0.500000  0.960288
4 -1.088520  0.500000 -0.635603
5  0.008473  0.285971  0.717458
6  0.436859  2.002107  0.432965

In [68]:
df.fillna(0, inplace=True)   # fillna returns a new object, but with inplace=True we modify the existing object in place
df

          0         1         2
0 -1.412371  0.000000  0.000000
1  0.025769  0.000000  0.000000
2  0.879552  0.000000  0.000000
3  0.201349  0.000000  0.960288
4 -1.088520  0.000000 -0.635603
5  0.008473  0.285971  0.717458
6  0.436859  2.002107  0.432965

In [69]:
df = pd.DataFrame(np.random.randn(6, 3))
df.ix[2:, 1] = np.nan; df.ix[4:, 2] = np.nan; df.ix[1, 0] = np.nan;
df

          0         1         2
0  0.339958  0.578985 -1.836484
1       NaN -0.265378 -0.130403
2 -1.385428       NaN -0.131590
3 -1.252071       NaN  0.306887
4 -0.468773       NaN       NaN
5 -0.355873       NaN       NaN

In [70]:
df.fillna(method='ffill')  # ffill - fill values forward, bfill - backward

          0         1         2
0  0.339958  0.578985 -1.836484
1  0.339958 -0.265378 -0.130403
2 -1.385428 -0.265378 -0.131590
3 -1.252071 -0.265378  0.306887
4 -0.468773 -0.265378  0.306887
5 -0.355873 -0.265378  0.306887

In [71]:
df.fillna(method='ffill', limit=2)  # limit - maximum number of consecutive periods to fill

          0         1         2
0  0.339958  0.578985 -1.836484
1  0.339958 -0.265378 -0.130403
2 -1.385428 -0.265378 -0.131590
3 -1.252071 -0.265378  0.306887
4 -0.468773       NaN  0.306887
5 -0.355873       NaN  0.306887

In [72]:
s = pd.Series([1., None, 3.5, None, 7])
s

0    1.0
1    NaN
2    3.5
3    NaN
4    7.0
dtype: float64

In [73]:
s.fillna(s.mean())

0    1.000000
1    3.833333
2    3.500000
3    3.833333
4    7.000000
dtype: float64

In [74]:
df = pd.DataFrame(np.random.randn(6, 3))
df.ix[2:, 1] = np.nan; df.ix[4:, 2] = np.nan; df.ix[1, 0] = np.nan;
df

          0         1         2
0 -0.154858  0.171813 -1.437835
1       NaN -0.385922 -0.067554
2  1.268611       NaN  0.011195
3 -1.365936       NaN -0.436533
4 -0.322210       NaN       NaN
5  0.222192       NaN       NaN

In [75]:
df[3] = df[0]
df

          0         1         2         3
0 -0.154858  0.171813 -1.437835 -0.154858
1       NaN -0.385922 -0.067554       NaN
2  1.268611       NaN  0.011195  1.268611
3 -1.365936       NaN -0.436533 -1.365936
4 -0.322210       NaN       NaN -0.322210
5  0.222192       NaN       NaN  0.222192

In [76]:
df[0] = df[0].fillna(np.mean(df[0]))
df[3] = df[3].fillna(np.median(df[0]))
df

          0         1         2         3
0 -0.154858  0.171813 -1.437835 -0.154858
1 -0.070440 -0.385922 -0.067554 -0.112649
2  1.268611       NaN  0.011195  1.268611
3 -1.365936       NaN -0.436533 -1.365936
4 -0.322210       NaN       NaN -0.322210
5  0.222192       NaN       NaN  0.222192

In [77]:
df = pd.DataFrame({'first_col': [1,2,None,8,-1, 3], 'second_col' :[0.1, 0.2,0.2,10.1,None,5.1]})
df

   first_col  second_col
0        1.0         0.1
1        2.0         0.2
2        NaN         0.2
3        8.0        10.1
4       -1.0         NaN
5        3.0         5.1

In [78]:
df.fillna(np.mean(df))

   first_col  second_col
0        1.0        0.10
1        2.0        0.20
2        2.6        0.20
3        8.0       10.10
4       -1.0        3.14
5        3.0        5.10

In [79]:
df

   first_col  second_col
0        1.0         0.1
1        2.0         0.2
2        NaN         0.2
3        8.0        10.1
4       -1.0         NaN
5        3.0         5.1

In [80]:
df['first_col'] = df['first_col'].fillna(np.mean(df['first_col']))
df['second_col'] = df['second_col'].fillna(np.mean(df['second_col']))
df

   first_col  second_col
0        1.0        0.10
1        2.0        0.20
2        2.6        0.20
3        8.0       10.10
4       -1.0        3.14
5        3.0        5.10

## Stop and think!

<font color='red'>
1. Load data breast-cancer-wisconsin.data.txt <br> 
2. Check dtypes of data frame <br> 
3. Check if there are missing values <br> 
4. Replace missing values with mean value in the column<br>

</font>

In [81]:
cancer_header = ['Sample code number', 'Clump Thickness', 'Uniformity of Cell Size', 'Uniformity of Cell Shape', 'Marginal Adhesion', 'Single Epithelial Cell Size', 'Bare Nuclei', 'Bland Chromatin', 'Normal Nucleoli', 'Mitoses', 'Class:'] 
cancer_data = pd.read_csv('breast-cancer-wisconsin.data.txt', header=None, names=cancer_header, na_values='?')
cancer_data.head()

,Sample code number,Clump Thickness,Uniformity of Cell Size,Uniformity of Cell Shape,Marginal Adhesion,Single Epithelial Cell Size,Bare Nuclei,Bland Chromatin,Normal Nucleoli,Mitoses,Class:
0,1000025,5,1,1,1,2,1.0,3,1,1,2
1,1002945,5,4,4,5,7,10.0,3,2,1,2
2,1015425,3,1,1,1,2,2.0,3,1,1,2
3,1016277,6,8,8,1,3,4.0,3,7,1,2
4,1017023,4,1,1,3,2,1.0,3,1,1,2

In [82]:
cancer_data.shape

(699, 11)